In [1]:
import pandas as pd
df=pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [2]:
inputs=df.drop("salary_more_then_100k",axis='columns')
target=df['salary_more_then_100k']

In [3]:
from sklearn.preprocessing import LabelEncoder
# LabelEncoder encode labels with a value between 0 and (number of classes-1)

In [4]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()
# le_degree

LabelEncoder()

In [9]:
inputs['company_n']=le_company.fit_transform(inputs['company'])
inputs['job_n']=le_job.fit_transform(inputs['job'])
inputs['degree_n']=le_degree.fit_transform(inputs['degree'])
inputs.head()
# upto here i just made the input dataframe...with facebook encoded as- 0, google- 1, abcpharma- 2.....
# the numbering may not be right but they are encoded

  company                  job  degree  company_n  job_n  degree_n
0  google      sales executive       0          2      2         0
1  google      sales executive       1          2      2         1
2  google     business manager       0          2      0         0
3  google     business manager       1          2      0         1
4  google  computer programmer       0          2      1         0

In [10]:
inputs_n=inputs.drop(['company','job','degree'],axis='columns')
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [11]:
from sklearn import tree

In [14]:
model=tree.DecisionTreeClassifier()

In [15]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [16]:
model.score(inputs_n,target)

1.0

In [ ]:
model.predict([[]])